// Part of MeasurementKit <https://measurement-kit.github.io/>.
// MeasurementKit is free software. See AUTHORS and LICENSE for more
// information on the copying conditions.
"app_name" = "ooniprobe";

"run_tests" = "テストを実行";
"past_tests" = "過去のテスト";
"settings" = "設定";
"about" = "アプリについて";

"dns_injection" = "DNS インジェクション";
"tcp_connect" = "TCP 接続";
"http_invalid_request_line" = "HTTP 無効なリクエスト行";
"http_header_field_manipulation" = "HTTP ヘッダーフィールドの操作";
"web_connectivity" = "Web 接続性";
"ndt" = "NDT スピードテスト";
"dash" = "DASH ストリーミングテスト";
"whatsapp" = "WhatsApp";
"telegram" = "Telegram";
"facebook_messenger" = "Facebook Messenger";

"web_connectivity_desc" = "ウェブサイトがブロックされているかどうかを確認します";
"http_invalid_request_line_desc" = "'ミドルボックス' を探す";
"http_header_field_manipulation_desc" = "'ミドルボックス' を探す";
"ndt_desc" = "ネットワーク速度とパフォーマンスを測定します";
"dash_desc" = "ビデオストリーミングの品質を測定";
"whatsapp_desc" = "WhatsAppがブロックされているかどうかを確認します";
"telegram_desc" = "Telegramがブロックされているかどうかを確認します";
"facebook_messenger_desc" = "Facebook Messengerがブロックされているかどうかを確認します";

"web_connectivity_longdesc" = "このテストは、DNS の改ざん、TCP/IP のブロック、または透過的な HTTP プロキシ経由で Web サイトへのアクセスがブロックされているかどうかを調べます。\n\nWeb 接続性を実行するたびに、異なる Web サイトをテストします。";
"http_invalid_request_line_longdesc" = "このテストは、無効な HTTP リクエスト行をエコーサービスに送信することによって、検閲や監視の責任を負う可能性のあるシステム (“ミドルボックス”) を検出しようとします。 そのようなシステムがネットワーク上にある場合、無効な HTTP リクエスト行が傍受されて、エラーが発生する可能性があります。";
"http_header_field_manipulation_longdesc" = "このテストは、非標準的ヘッダーを持つ HTTP リクエストをバックエンド制御サーバーに送信することによって、検閲や監視の責任を負う可能性のあるシステム (“ミドルボックス”) の存在を検出しようとします。 そのようなシステムがネットワークにある場合、ヘッダーを正規化したり、余分なヘッダーを追加したりすることがあります。";
"ndt_longdesc" = "このテストは、ネットワークの速度とパフォーマンスを測定します。\n\n免責事項: サードパーティのサーバーをベースにしたサードパーティのパフォーマンステストであり、IP アドレスの収集、処理、公開は保証されません。";
"dash_longdesc" = "このテストは、リモートサーバーからさまざまな品質でストリーミングする、非常にシンプルなビデオプレーヤーをエミュレートします。 テストは、ビデオストリーミングを行うネットワークのベースラインパフォーマンスを取得するように設計されています。\n\n免責事項: これは、サードパーティのサーバーをベースにしたサードパーティのパフォーマンステストであり、IP アドレスの収集、処理、公開は保証されません。 ";
"whatsapp_longdesc" = "このテストは、テストされるネットワーク内でWhatsAppのアプリとWhatsAppのWebバージョンの両方が到達できるかを調べるように設計されています。";
"telegram_longdesc" = "このテストは、テストされるネットワーク内でTelegramのアプリとWebバージョンが到達できるかを調べるように設計されています。";
"facebook_messenger_longdesc" = "このテストは、テストされるネットワーク内でFacebook Messengerが到達できるかを調べるように設計されています。";

"running_tests" = "テストの実行中";
"finished_tests" = "テストが完了しました";

"settings" = "設定";
"collector_address" = "収集アドレス";

"cancel" = "キャンセル";
"ok" = "OK";
"delete" = "削除";

"test_result" = "テスト結果";
"change" = "変更";

"welcome_ooniprobe" = "ooniprobe へようこそ!";
"get_started" = "始めましょう!";

"what_is_ooniprobe" = "ooniprobe とは?";
"learn_more" = "さらに詳しく";

"risks_text_1" = "ooniprobe はネットワーク上のインターネット検閲を調べることができる無料のオープンソースソフトウェアです!";
"risks_text_2" = "このアプリを実行することで、ウェブサイトがブロックされているかどうか、どのようにブロックされているか、ネットワークに検閲システムや監視システムがあるかどうかを調べることができます。";
"risks_text_3" = "このアプリを実行して、ネットワークの速度とパフォーマンスを測定することもできます。";
"risks_text_4" = "このアプリを通じて収集できるデータは、検閲の証拠となる可能性があります。";
"risks_text_5" = "ooniprobe は調査ツールなので、リスクが発生する可能性があります。";

"potential_risks" = "リスクの可能性";
"laws_text_1" = "あなたのインターネット活動を監視している人 (ISP、政府、雇用主など) は、(OONI がこれを難しくしようとしても) あなたが ooniprobe を実行していることを知ることができます。";
"laws_text_2" = "検閲のためにウェブサイトをテストする際には、あなたの国では違法かもしれない挑発的または好ましくないサイト (ポルノなど) に接続してデータをダウンロードします。";
"laws_text_3" = "OONI の HTTP 無効リクエスト行テストは、お使いの ISP の疑いを引き起こし、 \\"ハッキング\\" の一種とみなされる可能性があります。";
"laws_text_4" = "設定で変更を行わない限り、テストから収集されたすべてのデータはデフォルトで OONI によって公開され、個人識別可能な情報が含まれることがあります (たとえ OONI がこれを防止しようとしても)。";
"laws_text_5" = "あなたの国の法律にかかわらず、単なる ooniprobe の使用がスパイの一種とみなされるかもしれません。";
"laws_text_6" = "私たちの知る限りでは、ooniprobe ユーザーは、私たちのプラットフォームを使用することによる影響はこれまでにありませんでした。 しかし、多くの国ではデジタル著作権活動家を標的とし、虐待してきた長い歴史を持っているため、重大な民事、犯罪、司法違反の罰則を受ける可能性があります。";
"laws_text_6" = "私たちの知る限りでは、ooniprobe ユーザーは、私たちのプラットフォームを使用することによる影響はこれまでにありませんでした。 しかし、多くの国ではデジタル著作権活動家を標的とし、虐待してきた長い歴史を持っているため、重大な民事、犯罪、司法違反の罰則を受ける可能性があります。";
"i_understand_the_risks" = "私はリスクを理解しています。";

"pop_quiz" = "クイズを表示!";
"question_1" = "質問 1: 私のインターネット活動を監視している誰か (ISP、政府、または雇用主など) が、OONI がこれを難しくするための予防措置を講じるにもかかわらず、私が ooniprobe を実行しているのを知ることができるでしょうか?";
"question_2" = "質問 2: 私の測定値はデフォルトで OONI によって公開され、個人識別可能な情報が含まれることがありますか?";
"true" = "はい";
"false" = "いいえ";
"how_did_i_do" = "どうしましたか?";

"wrong" = "続行するには、もう少し読むことが必要です。";
"correct" = "よくできました! クイズに正しく答えました。";

"set_up_sharing" = "共有の設定";
"include_ip" = "IP を含めますか?";
"include_asn" = "ネットワーク情報をふくめますか?";
"include_cc" = "国名を含めますか?";
"upload_results" = "結果を公開して共有しますか?";
"settings_text" = "すべての測定値はデフォルトで OONI の測定コレクターに送信され、 OONI エクスプローラーと OONI の測定値リストによって自動的に公開されます。";
"im_all_set" = "すべて設定しました!";
"ooniprobe_configured" ="ooniprobe を正常に設定しました。 すべて準備できました!";

"about_ooni" = "OONI について";
"about_text_1" = "OONI (Open Observatory of Network Interference) は、世界中のインターネット検閲の透明性を高めることを目的とした The Tor プロジェクトの下でのフリーソフトウェアプロジェクトです。";
"about_text_2" ="2012 年以来、OONI は世界中から数百万のネットワーク測定値を収集し、インターネット検閲と通信操作の複数の事例を明らかにしています。";
"learn_more" = "さらに詳しく";

"run" = "実行";
"view" = "表示";

"no_result" = "結果はありません";
"no_result_msg" = "テストに結果がない、または中断されました";

"local_notifications" = "テスト実行リマインダー";
"local_notifications_time" = "時間";
"local_notifications_text" = "テストを実行する時間";

"notifications" = "通知";

"max_runtime" = "Web 接続の最大実行時間 (秒)";
"advanced_settings" = "詳細設定";
"finished_running" = "%@ 実行が完了しました";
"view_log" = "ログを表示";
"copy_to_clipboard" = "クリップボードにコピー";
"copied_clipboard" = "クリップボードにコピーしました";
"send_crash" = "クラッシュレポートを送信";
"privacy" = "プライバシー";
"view_data_policy" = "ここをクリックするとデータポリシーを表示します";
"test_name_finished" = "%@ が完了しました。過去のテストに移動して、結果を表示します";
"open_url_alert" = "次の URL を開きますか?";
"max_runtime_low" = "入力した最大実行時間が低すぎるため、デフォルトに設定します。";
"clear_all_tests_alert" = "すべてのテスト結果を削除しますか?";
"past_tests_empty" = "テストが完了すると、過去のテスト結果がここに表示されます";

"try_mirror" = "ミラーで試す";
"loading" = "読み込み中...";
"set_default" = "デフォルトに設定";

"run_test_message" = "ネットワークで ooniprobe テストを実行しようとしています";
"urls" = "URL";
"test_name" = "テスト名";
"test_details" = "テスト詳細";
"ooniprobe_outdate" = "古い ooniprobe です";
"ooniprobe_outdate_msg" = "このテストを実行するには、新しいバージョンの ooniprobe が必要です。下のボタンをクリックして更新してください";
"invalid_parameter" = "無効なパラメータ";
"random_sampling_urls" = "グローバルリストからランダムなURLのサンプリング";

"websites" = "ウェブサイト";
"instant_messaging" = "Instant Messaging";
"middle_boxes" = "Middle Boxes";
"performance" = "パフォーマンス";
